/* Завдання 2: Конкатенація радків та шаблонний рядок

Створіть дві змінні, які містять імена двох осіб. Використовуючи конкатенацію рядків, створіть новий рядок, який містить вітання для обох осіб. 
Виведіть результат в консоль. 
Потім використайте шаблонний рядок для створення того ж вітання. Виведіть результат в консоль. */

const name1 = 'Mery';
const name2 = 'John';

let welcome = 'Hello' + ' ' + name1 + ' ' + 'and' + ' ' + 'hello' + ' ' + name2;

console.log(welcome);

let templateWelcome = `Hello ${name1} and hi ${name2}!`;
 console.log(templateWelcome);
